{"config": [{"config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "filters": 32, "padding": "valid", "batch_input_shape": [null, 30, 30, 1], "use_bias": true, "activation": "relu", "kernel_size": [5, 5], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "name": "conv2d_1", "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "filters": 64, "use_bias": true, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [5, 5], "trainable": true, "bias_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"units": 1000, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"units": 500, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "bias_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"units": 50, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "bias_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "bias_regularizer": null, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "bias_regularizer": null, "name": "dense_5"}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow"}