{"class_name": "Sequential", "config": [{"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [4, 4], "data_format": "channels_last", "strides": [4, 4], "batch_input_shape": [null, 60, 60, 1], "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "batch_input_shape": [null, 60, 60, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "dtype": "float32", "activity_regularizer": null, "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 64, "name": "conv2d_1", "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.1, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "strides": [1, 1], "activation": "relu", "bias_regularizer": null, "kernel_size": [2, 2], "kernel_constraint": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 64, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "units": 500, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "name": "dense_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "units": 1, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "name": "dense_2"}}], "keras_version": "2.2.2", "backend": "tensorflow"}