{"config": [{"config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [4, 4], "batch_input_shape": [null, 60, 60, 1], "data_format": "channels_last", "pool_size": [4, 4], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "padding": "valid", "batch_input_shape": [null, 60, 60, 1], "kernel_size": [4, 4], "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "name": "conv2d_1", "strides": [2, 2], "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "rate": 0.1, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"filters": 64, "padding": "valid", "bias_regularizer": null, "kernel_size": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "conv2d_2", "strides": [1, 1], "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "units": 500, "name": "dense_1", "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "units": 1, "name": "dense_2", "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}