{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "trainable": true, "padding": "valid", "pool_size": [4, 4], "name": "max_pooling2d_1", "data_format": "channels_last", "batch_input_shape": [null, 60, 60, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "filters": 64, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activation": "relu", "bias_constraint": null, "trainable": true, "kernel_size": [4, 4], "batch_input_shape": [null, 60, 60, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_1", "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.1}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activation": "relu", "bias_constraint": null, "trainable": true, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_2", "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "bias_constraint": null, "name": "dense_1", "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "bias_constraint": null, "name": "dense_2", "use_bias": true, "kernel_regularizer": null}}]}