{"config": [{"config": {"pool_size": [4, 4], "batch_input_shape": [null, 60, 60, 1], "name": "max_pooling2d_1", "trainable": true, "strides": [4, 4], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "batch_input_shape": [null, 60, 60, 1], "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "padding": "valid", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "name": "conv2d_1", "kernel_size": [4, 4], "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.1, "noise_shape": null, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "padding": "valid", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "name": "conv2d_2", "kernel_size": [2, 2], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "activation": "relu", "units": 500, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "activation": "linear", "units": 1, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}