{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "MaxPooling2D", "config": {"trainable": true, "batch_input_shape": [null, 32, 32, 1], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "filters": 64, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activation": "relu", "strides": [2, 2], "kernel_size": [4, 4], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.1}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "filters": 32, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activation": "relu", "strides": [2, 2], "kernel_size": [2, 2], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.1}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "filters": 32, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "kernel_size": [2, 2], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 500, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "name": "dense_2", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}}], "class_name": "Sequential"}